# tasks/task1.py



def solve():
# # Ниже пишите решение задачии(Обязательно поставьте четыре пробела после функции Solve())
    # Задание 4. Перевод температуры
    C = float(input("Введите температуру в градусах Цельсия: "))
    F = (9/5) * C + 32
    print("Температура в градусах Фаренгейта:", F)


# Код ниже не трогать! он нужен для тестов
if __name__ == "__main__":
    solve()