# Задание 4. Перевод температуры
C = float(input("Введите температуру в градусах Цельсия: "))
F = (9/5) * C + 32
print(f"Температура в градусах Фаренгейта: {F}")