# Задание 2. Площадь треугольника
a = float(input("Введите основание a: "))
h = float(input("Введите высоту h: "))
S = 0.5 * a * h
print(f"Площадь треугольника: {S}")