# tests/test_task1.py

# Задание 1. Сумма чисел
num1 = int(input("Введите первое число: "))
num2 = int(input("Введите второе число: "))
sum_result = num1 + num2
print(f"Сумма: {sum_result}")