# Задание 3. Индекс массы тела (BMI)
weight = float(input("Введите вес (в кг): "))
height = float(input("Введите рост (в метрах): "))
bmi = weight / (height ** 2)
print(f"Индекс массы тела (BMI): {bmi}")